Tekla Open API Reference for Tekla Structures 2025
LineTypeAttributes Constructor
Overload List
Name | Description
LineTypeAttributes()
 Creates a new line type attributes instance.
LineTypeAttributes(LineTypes, DrawingColors)
 Creates a new line type attributes instance with the given line type and color.
LineTypeAttributes(LineTypes, TeklaDrawingColor)
 Creates a new line type attributes instance with the given line type and color.
Top
See Also
Reference
LineTypeAttributes Class
Tekla.Structures.Drawing Namespace